Repository: schastev/membership_bot
Catalog: src/locales/*/LC_MESSAGES/mb_bot.po
Languages: ru

# greeting
source: Hello! This bot will help you manage your memberships with {company_name}. Please pick one of the options below:
ru: Здравствуйте! Этот бот поможет вам управлять вашими абонементами у {company_name}. Выберите одну из опций ниже:

# first_greeting
source: Hello! Please select your locale from the list below.
ru: Здравствуйте! Выберите язык из списка ниже.

# ADD_MEMBERSHIP_ok_admin
source: Membership with {mb_value} uses for client {member_name} was added successfully.
ru: Абонемент на {mb_value} занятий был добавлен клиенту {member_name}.

# ADD_MEMBERSHIP_ok_member
source: A membership with {mb_value} uses was added for you.
ru: Вам был добавлен абонемент на {mb_value} занятий.

# MB_INFO_general
source: Here is your active membership info: Purchase date: {mb_purchase_date} Total uses: {mb_total_amount}
ru: Данные вашего активного абонемента: Дата покупки: {mb_purchase_date} Количество занятий: {mb_total_amount}

# MB_INFO_active
source: Uses left: {mb_rmn_value} Activation date: {mb_act_date} Expiry date: {mb_exp_date}
ru: Осталось занятий: {mb_rmn_value} Дата активации: {mb_act_date} Срок действия: {mb_exp_date}

# MB_INFO_frozen
source: Freeze date: {mb_freeze_date} Unfreeze date: {mb_unfreeze_date}
ru: Дата заморозки: {mb_freeze_date} Дата окончания заморозки: {mb_unfreeze_date}

# FREEZE_MEMBERSHIP_error_not_active
source: You cannot freeze an inactive membership.
ru: Заморозить можно только активированный абонемент.

# FREEZE_MEMBERSHIP_error_negative_duration
source: Non-positive freeze period duration.
ru: Не положительная продолжительность периода заморозки.

# FREEZE_MEMBERSHIP_error_second_freeze
source: A membership can only be frozen once.
ru: Заморозить один абонемент можно только один раз.

# FREEZE_MEMBERSHIP_error_already_frozen
source: This membership is already frozen.
ru: Абонемент уже заморожен.

# UNFREEZE_MEMBERSHIP_error_not_frozen
source: This membership has not been frozen. Cannot unfreeze.
ru: Указанный абонемент не был заморожен.

# UNFREEZE_MEMBERSHIP_error_unfreeze_before_freeze
source: Unfreeze date must be after freeze date.
ru: Дата разморозки должна быть позже даты заморозки.

# CHECK_IN_error_cannot_subtract
source: Membership expired or used up.
ru: Абонемент полностью использован или истек срок его действия.

# MB_INFO_past
source: Total uses: {total}. Used between {act_date} and {exp_date}.
ru: Номинал: {total}. Период использования: {act_date} - {exp_date}

# VIEW_ACTIVE_MEMBERSHIP_error_no
source: No active membership.
ru: Нет активного абонемента.

# CHECK_IN_none
source: No check-ins for this membership yet.
ru: Нет посещений по активному абонементу.

# MANAGE_MEMBERSHIP_options
source: Please select the desired action.
ru: Выберите необходимое действие.

# ADD_MEMBERSHIP_error_expired
source: This request has already been processed or it is expired.
ru: Этот запрос уже был обработан или истек срок его действия.

# ADD_MEMBERSHIP_query_value
source: Please select the number of membership uses from the list below:
ru: Выберите размер абонемента из следующего списка:

# ADD_MEMBERSHIP_declined
source: Your membership request was declined.
ru: Ваша заявка на абонемент была отклонена.

# FREEZE_MEMBERSHIP_ok_admin
source: The membership was frozen until {unfreeze_date}.
ru: Абонемент был заморожен до {unfreeze_date}.

# FREEZE_MEMBERSHIP_ok_member
source: Your active membership has been frozen until {unfreeze_date}.
ru: Ваш активный абонемент был заморожен до {unfreeze_date}.

# welcome
source: Welcome! Please enter your name.
ru: Спасибо, что решили зарегистрироваться! Пожалуйста, введите ваше имя.

# REGISTER_error_already_registered
source: You are already registered! You can go on to the membership management.
ru: Вы уже зарегистрированы! Вы можете пользоваться всеми возможностями бота.

# CHANGE_SETTINGS_text
source: Please select the settings you would like to change.
ru: Выберите настройки пользователя, которые хотите изменить.

# CHANGE_SETTINGS_first_phone_query
source: Please enter your phone.
ru: Пожалуйста, введите ваш телефон.

# REGISTER_ok
source: Thank you for registering, {name}! You have been registered with phone {phone}.
ru: Спасибо за регистрацию, {name}! Вы были зарегистрированы с телефоном {phone}.

# CHANGE_SETTINGS_query_name
source: Please enter your new name.
ru: Пожалуйста, введите ваше имя.

# CHANGE_SETTINGS_query_phone
source: Please enter your new phone.
ru: Пожалуйста, введите ваш телефон.

# CHANGE_SETTINGS_name_ok
source: Alright, {name}, your name has been updated.
ru: {name}, ваше имя было обновлено.

# CHANGE_SETTINGS_phone_ok
source: Alright, {name}, your phone has been updated.
ru: {name}, ваш телефон был обновлен.

# CHANGE_LOCALE_text
source: Please select your locale from the list below.
ru: Выберите язык из списка ниже.

# DELETE_USER_query
source: Are you sure you would like to delete all your data from this bot? This action cannot be undone. Your data includes your account, memberships, attendance and request records.
ru: Вы уверены, что хотите удалить все свои данные, имеющиеся у этого бота? Это действие нельзя отменить.Ваши данные включают ваш аккаунт, абонементы, посещения и запросы.Для подтверждения удаления отправьте сообщение с текстом "{confirmation_text}" без кавычек.

# DELETE_USER_confirm
source: Delete
ru: Удалить

# DELETE_USER_ok
source: Your account and and related memberships, attendance and request records have been deleted.
ru: Ваш аккаунт и связанные с ним абонементы, посещения и запросы удалены.

# CHECK_IN_error_expired
source: This request has already been processed or it is expired.
ru: Этот запрос уже был обработан или истек срок его действия.

# CHECK_in_ok_admin
source: Checked in {name}.
ru: Клиенту {name} была проставлена отметка о посещении.

# CHECK_in_ok_member
source: You have successfully checked in.
ru: Вам была проставлена отметка о посещении.

# VIEW_ALL_MEMBERSHIPS_error_no
source: You don't have any memberships yet.
ru: У вас еще нет абонементов.

# FREEZE_MEMBERSHIP_query_duration
source: Please enter desired freeze period duration. It must be no longer than {max_freeze_duration} days.
ru: Введите продолжительность периода заморозки в днях. Максимальное значение - {max_freeze_duration}.

# UNFREEZE_MEMBERSHIP_ok
source: Your membership has been unfrozen.
ru: Ваш абонемент был разморожен.

# pending_membership
source: membership
ru: абонементы

# pending_attendance
source: check-in
ru: отметку о посещении

# pending_freeze
source: membership freeze
ru: заморозку абонемента

# REQUEST_sent
source: Your request for {request_type} has been sent to the admin.
ru: Ваш запрос на {request_type} был отправлен администратору.

# REQUEST_error_already_existed
source: you have already sent a request of this type. Please wait until the administrator processes it.
ru: Вы уже отправили запрос такого типа. Подождите, пока администратор его обработает.

# ADD_MEMBERSHIP_button
source: Add membership
ru: Добавить абонемент

# CHECK_IN_button
source: Check in
ru: Отметиться

# FREEZE_MEMBERSHIP_button
source: Freeze membership
ru: Заморозить абонемент

# polling
source: Polling for new {request_type_string} requests. The requesting person needs to press the "{button_name}" button in their conversation with this bot. They need to do so within {timeout_seconds} seconds.
ru: Ожидаем новые запросы на {request_type_string}. Клиент должен нажать кнопку "{button_name}" в чате с этим ботом в течение следующих {timeout_seconds} секунд.

# polling_timeout
source: No new requests found. Try again after making sure that the requesting person pressed the "{button_name}" button in their conversation with this bot.
ru: Новых запросов не найдено. Убедитесь, что клиент нажал на кнопку "{button_name}" в чате с этим ботом.

# pending_list
source: Here are pending requests for {request_type}:
ru: Текущие необработанные запросы на {request_type}:

# ADD_MEMBERSHIP_decline_button
source: Decline
ru: Отклонить

# button_cancel
source: Cancel
ru: Отменить

source: Cancelled.
ru: Отменено.

# MANAGE_MEMBERSHIP_button
source: Manage memberships
ru: Управление абонементами

# MANAGE_ATTENDANCE_button
source: Manage attendance
ru: Управление посещениями

# CHANGE_SETTINGS_button
source: Change user settings
ru: Изменить настройки пользователя

# VIEW_ACTIVE_MEMBERSHIP_button
source: View active membership
ru: Активный абонемент

# VIEW_ALL_MEMBERSHIPS_button
source: View all memberships
ru: Все абонементы

# VIEW_ATTENDANCES_button
source: View attendance
ru: Мои посещения

# UNFREEZE_MEMBERSHIP_button
source: Unfreeze membership
ru: Разморозить абонемент

# CHANGE_NAME_button
source: Change name
ru: Изменить имя

# CHANGE_PHONE_button
source: Change phone
ru: Изменить телефон

# CHANGE_LOCALE_button
source: Change locale
ru: Изменить язык

# REGISTER_button
source: Register
ru: Зарегистрироваться

# DELETE_USER_button
source: Delete user
ru: Удалить данные
